Revit 2024 API
ChangeType Members
The ChangeType type exposes the following members.
Methods
Name | Description
ConcatenateChangeTypes
 Creates a ChangeType that is a union of the two input ChangeTypes
Contains
 Checks whether this ChangeType contains the input ChangeType
Dispose
Releases all resources used by the ChangeType
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsIdentical
 Compares if two ChangeTypes are identical
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ChangeType Class
Autodesk.Revit.DB Namespace